package com.yimei.finance.representation.admin.finance.enums;

public enum EnumAdminFinanceError {
    此金融单不存在,
    此流程不存在或已经结束,
    你没有查看此金融单的权限,
    你没有查看此流程的权限,
    你没有处理此金融单的权限,
    此金融单已经创建流程,
    你没有权限处理此任务或者你已经处理过,
    此任务不存在或者已经完成,
    你已经处理此任务,
    你没有权限领取此任务,
    此任务已经被其他人处理,
    不存在此任务,
    此任务不能进行交易员审核操作,
    此任务不能进行业务员审核操作,
    此任务不能进行业务员补充尽调员材料操作,
    此任务不能进行业务员补充监管员材料操作,
    此任务不能进行尽调员审核操作,
    此任务不能进行监管员审核操作,
    此任务不能进行风控人员审核操作,
    此任务不能进行填写合同操作,
    此任务不能进行业务员补充风控人员要求的材料操作,
    此任务不能进行监管员补充风控人员要求的材料操作,
    此订单不是煤易融业务,
    此订单不是煤易购业务,
    此订单不是煤易贷业务,
    你没有权限处理此任务,
    ;

}
